young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotB/libraries/drivers/inc/at32f422_426_can.h
  uint8_t                                final_handle;   /*!< specifies final handle for frame identification. */
  
  can_tstat_encoding_type                final_tstat;    /*!< specifies final transmission status of transmit frame.*/
  
} can_transmit_status_type;

/**
  * @brief  can transmit buffer structure definition
  */
typedef struct
{
  uint32_t                               id;             /*!< specifies the 11 or 29 bits standard or extended identifier. 
                                                              this parameter can be a value between 0 to 0x7FF or 0 to 0x1FFFFFFF. */

  can_identifier_type                    id_type;        /*!< specifies identifier type for the transmit buffer. */

  can_frame_type                         frame_type;     /*!< specifies frame type for the transmit buffer. */
 
  can_data_length_type                   data_length;    /*!< specifies the frame data length that will be transmitted. */

#ifdef SUPPORT_CAN_FD
  can_format_type                        fd_format;      /*!< specifies format for the transmit buffer. */

  can_rate_switch_type                   fd_rate_switch; /*!< specifies bit rate switch for the transmit buffer. */
 
  uint8_t                                data[64];       /*!< contains the transmit data. it ranges from 0 to 0xFF. */
#else
  uint8_t                                data[8];        /*!< contains the transmit data. it ranges from 0 to 0xFF. */
#endif
  
  confirm_state                          tx_timestamp;   /*!< specifies get transmit timestamp for the transmit buffer. */
  
  uint8_t                                handle;         /*!< The purpose of the handle is frame identification using TSTAT(transmit status). */

} can_txbuf_type;

/**
  * @brief  can receive buffer structure definition
  */
typedef struct
{ 
  uint32_t                               id;             /*!< specifies the 11 or 29 bits standard or extended identifier.
                                                              this parameter can be a value between 0 to 0x7FF or 0 to 0x1FFFFFFF. */
                                         
  can_identifier_type                    id_type;        /*!< specifies identifier type for the receive buffer. */
                                         
  can_frame_type                         frame_type;     /*!< specifies frame type for the receive buffer. */
                                         
  can_data_length_type                   data_length;    /*!< specifies the frame data length that will be received. */
                                         
#ifdef SUPPORT_CAN_FD                    
  can_format_type                        fd_format;      /*!< specifies format for the receive buffer. */
                                         
  can_rate_switch_type                   fd_rate_switch; /*!< specifies bit rate switch for the receive buffer. */
                                         
  can_error_state_type                   fd_error_state; /*!< specifies error state indicator type for the receive buffer. */
                                         
  uint8_t                                data[64];       /*!< contains the receive data. it ranges from 0 to 0xFF. */
#else                                    
  uint8_t                                data[8];        /*!< contains the receive data. it ranges from 0 to 0xFF. */
#endif                                   
                                         
  can_recv_frame_type                    recv_frame;     /*!< specifies receive frame mode for the receive buffer. */
                                         
  can_error_type                         kind_error;     /*!< specifies kind of error type for the receive buffer. */
                                         
  uint32_t                               rx_timestamp;   /*!< specifies the timestamp for the receive buffer. */

  uint16_t                               cycle_time;     /*!< specifies the cycle time for the receive buffer using TTCAN(Time-Triggered CAN). */

} can_rxbuf_type;

/**
  * @brief  can filter code type
  */
typedef struct
{ 
  uint32_t                               id;             /*!< specifies the 11 or 29 bits standard or extended identifier.
                                                              this parameter can be a value between 0 to 0x7FF or 0 to 0x1FFFFFFF. */

  can_identifier_type                    id_type;        /*!< specifies identifier type for the filter code. */

  can_frame_type                         frame_type;     /*!< specifies frame type for the filter code. */
 
  uint8_t                                data_length;    /*!< specifies frame data length for the filter code. */
 
#ifdef SUPPORT_CAN_FD  
  can_format_type                        fd_format;      /*!< specifies format for the filter code. */

  can_rate_switch_type                   fd_rate_switch; /*!< specifies bit rate switch for the filter code. */
 
  can_error_state_type                   fd_error_state; /*!< specifies error state indicator for the filter code. */
#endif  
  
  can_recv_frame_type                    recv_frame;     /*!< specifies receive frame mode for the filter code. */

} can_filter_code_type;              

/**
  * @brief  can filter mask type
  */
typedef struct
{ 
  uint32_t                               id;             /*!< specifies the 11 or 29 bits standard or extended identifier.
                                                              this parameter can be a value between 0 to 0x7FF or 0 to 0x1FFFFFFF. */
                                    
  confirm_state                          id_type;        /*!< specifies identifier type for the filter mask. */
                                       
  confirm_state                          frame_type;     /*!< specifies frame type for the filter mask. */
                                       
  uint8_t                                data_length;    /*!< specifies frame data length for the filter mask. */ 
                                       
#ifdef SUPPORT_CAN_FD                    
  confirm_state                          fd_format;      /*!< specifies format for the filter mask. */
                                         
  confirm_state                          fd_rate_switch; /*!< specifies bit rate switch for the filter mask. */
                                         
  confirm_state                          fd_error_state; /*!< specifies error state indicator for the filter mask. */
#endif                                   
                              
