young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotB/libraries/drivers/inc/at32f422_426_can.h
  confirm_state                          recv_frame;     /*!< specifies receive frame mode for the filter mask. */
  
} can_filter_mask_type;

/**
  * @brief  can filter config type
  */
typedef struct
{ 
  can_filter_code_type                   code_para;      /*!< specifies the filter code type. */
  
  can_filter_mask_type                   mask_para;      /*!< specifies the filter mask type. */
  
} can_filter_config_type;

/**
  * @brief  can baudrate structure definition
  */
typedef struct
{
  uint8_t                                bittime_div;    /*!< bittime division, this parameter can be 0x01~0x20. */
  
  uint8_t                                ac_rsaw_size;   /*!< classic-can resynchronization adjust width, this parameter can be 0x01~0x80. */
  
  uint16_t                               ac_bts1_size;   /*!< classic-can bit time segment 1, this parameter can be 0x02~0x201. */
  
  uint8_t                                ac_bts2_size;   /*!< classic-can bit time segment 2, this parameter can be 0x01~0x80. */
  
#ifdef SUPPORT_CAN_FD 
  uint8_t                                fd_rsaw_size;   /*!< can-fd resynchronization adjust width, this parameter can be 0x01~0x80. */

  uint16_t                               fd_bts1_size;   /*!< can-fd bit time segment 1, this parameter can be 0x02~0x101. */

  uint8_t                                fd_bts2_size;   /*!< can-fd bit time segment 2, this parameter can be 0x01~0x80. */
  
  uint8_t                                fd_ssp_offset;  /*!< can-fd secondary sample point offset, this parameter can be 0x00~0xFF. */
#endif 
 
} can_bittime_type;

/**
  * @brief type define can register all
  */
typedef struct
{  
  /**
    * @brief can tncfg register, offset:0x00 
    */
  union
  {
    __IO uint32_t tncfg;
    struct
    {
      __IO uint32_t reserved1            : 17;/* [16:0] */
      __IO uint32_t rop                  : 1; /* [17] */
      __IO uint32_t reserved2            : 6; /* [23:18] */ 
      __IO uint32_t tsen                 : 1; /* [24] */ 
      __IO uint32_t tspos                : 1; /* [25] */ 
      __IO uint32_t reserved3            : 6; /* [31:26] */ 
    } tncfg_bit;
  };
  
  /**
    * @brief can actime register, offset:0x04 
    */
  union
  {
    __IO uint32_t actime;
    struct
    {
      __IO uint32_t ac_seg_1            : 9; /* [8:0] */
      __IO uint32_t reserved1           : 7; /* [15:9] */
      __IO uint32_t ac_seg_2            : 7; /* [22:16] */
      __IO uint32_t reserved2           : 1; /* [23] */
      __IO uint32_t ac_sjw              : 7; /* [30:24] */ 
      __IO uint32_t reserved3           : 1; /* [31] */      
    } actime_bit;
  };
  
  /**
    * @brief can fdtime register, offset:0x08 
    */
  union
  {
    __IO uint32_t fdtime;
    struct
    {
      __IO uint32_t fd_seg_1            : 8; /* [7:0] */
      __IO uint32_t reserved1           : 8; /* [15:8] */
      __IO uint32_t fd_seg_2            : 7; /* [22:16] */
      __IO uint32_t reserved2           : 1; /* [23] */
      __IO uint32_t fd_sjw              : 7; /* [30:24] */ 
      __IO uint32_t reserved3           : 1; /* [31] */      
    } fdtime_bit;
  };
  
  /**
    * @brief can reserved1 register, offset:0x0C 
    */
  __IO uint32_t reserved1;
  
  /**
    * @brief can lbtcfg register, offset:0x10 
    */
  union
  {
    __IO uint32_t lbtcfg;
    struct
    {
      __IO uint32_t presc               : 5; /* [4:0] */
      __IO uint32_t reserved1           : 3; /* [7:5] */
      __IO uint32_t fd_sspoff           : 8; /* [15:8] */
      __IO uint32_t reserved2           : 8; /* [23:16] */
      __IO uint32_t realim              : 3; /* [26:24] */ 
      __IO uint32_t reserved3           : 1; /* [27] */ 
      __IO uint32_t retlim              : 3; /* [30:28] */
      __IO uint32_t reserved4           : 1; /* [31] */ 
    } lbtcfg_bit;
  };
  
  /**
    * @brief can sts register, offset:0x14 
    */
  union
  {
    __IO uint32_t sts;
    struct
    {
      __IO uint32_t aif                 : 1; /* [0] */
      __IO uint32_t eif                 : 1; /* [1] */
      __IO uint32_t tsif                : 1; /* [2] */
      __IO uint32_t tpif                : 1; /* [3] */
      __IO uint32_t rafif               : 1; /* [4] */ 
      __IO uint32_t rfif                : 1; /* [5] */      
      __IO uint32_t roif                : 1; /* [6] */
      __IO uint32_t rif                 : 1; /* [7] */
      __IO uint32_t beif                : 1; /* [8] */
      __IO uint32_t alif                : 1; /* [9] */
      __IO uint32_t epif                : 1; /* [10] */
      __IO uint32_t ttif                : 1; /* [11] */
      __IO uint32_t teif                : 1; /* [12] */
      __IO uint32_t wtif                : 1; /* [13] */
      __IO uint32_t reserved1           : 16; /* [29:14] */
      __IO uint32_t epass               : 1; /* [30] */
      __IO uint32_t ewarn               : 1; /* [31] */
    } sts_bit;
  };

  /**
    * @brief can reserved register, offset:0x18 
    */
  __IO uint32_t reserved2;

  /**
    * @brief can tstat register, offset:0x1C 
    */
  union
  {
    __IO uint32_t tstat;
    struct
    {
      __IO uint32_t handle_1            : 8; /* [7:0] */
      __IO uint32_t tstat_1             : 3; /* [10:8] */
      __IO uint32_t reserved1           : 5; /* [15:11] */
      __IO uint32_t handle_2            : 8; /* [23:16] */
      __IO uint32_t tstat_2             : 3; /* [26:24] */ 
      __IO uint32_t reserved2           : 5; /* [31:27] */      
    } tstat_bit;
  };
  
  /**
    * @brief can tts register, offset:0x20 
    */
  __IO uint32_t tts;
  
  /**
    * @brief can reserved register, offset:0x24
    */
  __IO uint32_t reserved3;
  
  /**
    * @brief can ctrlstat register, offset:0x28 
    */
  union
  {
    __IO uint32_t ctrlstat;
    struct
    {
      __IO uint32_t busoff              : 1; /* [0] */
      __IO uint32_t reserved1           : 4; /* [4:1] */
      __IO uint32_t lbmi                : 1; /* [5] */
      __IO uint32_t lbme                : 1; /* [6] */
      __IO uint32_t reset               : 1; /* [7] */ 
      __IO uint32_t tsa                 : 1; /* [8] */ 
      __IO uint32_t tsall               : 1; /* [9] */
      __IO uint32_t tsone               : 1; /* [10] */
      __IO uint32_t tpa                 : 1; /* [11] */
      __IO uint32_t tpe                 : 1; /* [12] */
      __IO uint32_t stby                : 1; /* [13] */
      __IO uint32_t lom                 : 1; /* [14] */
      __IO uint32_t tbsel               : 1; /* [15] */
      __IO uint32_t tsstat              : 2; /* [17:16] */   
      __IO uint32_t tsff                : 1; /* [18] */ 
      __IO uint32_t reserved2           : 1; /* [19] */ 
      __IO uint32_t tttbm               : 1; /* [20] */
      __IO uint32_t tsmode              : 1; /* [21] */
      __IO uint32_t tsnext              : 1; /* [22] */
      __IO uint32_t fd_iso              : 1; /* [23] */
      __IO uint32_t rstat               : 2; /* [25:24] */
      __IO uint32_t reserved3           : 1; /* [26] */
      __IO uint32_t rball               : 1; /* [27] */
      __IO uint32_t rrel                : 1; /* [28] */
      __IO uint32_t rov                 : 1; /* [29] */
      __IO uint32_t rom                 : 1; /* [30] */
      __IO uint32_t sack                : 1; /* [31] */
    } ctrlstat_bit;
  };
  
  /**
    * @brief can err register, offset:0x2C 
    */
  union
  {
    __IO uint32_t err;
    struct
    {
      __IO uint32_t ewl                 : 4; /* [3:0] */
      __IO uint32_t afwl                : 4; /* [7:4] */
      __IO uint32_t alc                 : 5; /* [12:8] */
      __IO uint32_t koer                : 3; /* [15:13] */
      __IO uint32_t recnt               : 8; /* [23:16] */ 
      __IO uint32_t tecnt               : 8; /* [31:24] */      
    } err_bit;
  };
  
  /**
    * @brief can refmsg register, offset:0x30 
    */
  union
  {
    __IO uint32_t refmsg;
    struct
    {
      __IO uint32_t ref_id              : 29; /* [28:0] */
      __IO uint32_t reserved1           : 2; /* [30:29] */
      __IO uint32_t ref_ide             : 1; /* [31] */     
    } refmsg_bit;
  };
  
  /**
    * @brief can ttcfg register, offset:0x34 
    */
  union
  {
    __IO uint32_t ttcfg;
    struct
    {
      __IO uint32_t ttptr               : 6; /* [5:0] */
      __IO uint32_t reserved1           : 2; /* [7:6] */
      __IO uint32_t ttype               : 3; /* [10:8] */
      __IO uint32_t reserved2           : 1; /* [11] */
      __IO uint32_t tew                 : 4; /* [15:12] */ 
      __IO uint32_t tbptr               : 6; /* [21:16] */  
      __IO uint32_t tbf                 : 1; /* [22] */  
      __IO uint32_t tbe                 : 1; /* [23] */
      __IO uint32_t tten                : 1; /* [24] */
      __IO uint32_t t_presc             : 2; /* [26:25] */
      __IO uint32_t reserved3           : 5; /* [31:27] */
    } ttcfg_bit;
  };
  
  /**
    * @brief can tttrig register, offset:0x38 
    */
  union
  {
    __IO uint32_t tttrig;
    struct
    {
      __IO uint32_t tttrig              : 16; /* [15:0] */
      __IO uint32_t ttwtrig             : 16; /* [31:16] */  
    } tttrig_bit;
  };
  
  /**
    * @brief can reserved register, offset:0x3C-0x40 
    */
  __IO uint32_t reserved4[2];
  
  /**
    * @brief can acfctrl register, offset:0x44 
    */
  union
  {
    __IO uint32_t acfctrl;
    struct
    {
      __IO uint32_t acfadr              : 4; /* [3:0] */
      __IO uint32_t reserved1           : 12; /* [15:4] */
      __IO uint32_t ae_x                : 16; /* [31:16] */
    } acfctrl_bit;
  };
  
  /**
    * @brief can fcid register, offset:0x48 
    */
  __IO uint32_t fcid;

  /**
    * @brief can fcfmt register, offset:0x4C 
    */
  union 
  {
    __IO uint32_t fcfmt;
    struct
    {
      __IO uint32_t dlc                 : 4; /* [3:0] */
      __IO uint32_t reserved1           : 12; /* [15:4] */
      __IO uint32_t ide                 : 1; /* [16] */
      __IO uint32_t fdf                 : 1; /* [17] */  
      __IO uint32_t brs                 : 1; /* [18] */
      __IO uint32_t reserved2           : 1; /* [19] */
      __IO uint32_t rmf                 : 1; /* [20] */
      __IO uint32_t reserved3           : 3; /* [23:21] */
      __IO uint32_t koer                : 3; /* [26:24] */
      __IO uint32_t esi                 : 1; /* [27] */
      __IO uint32_t lbf                 : 1; /* [28] */
      __IO uint32_t reserved4           : 3; /* [31:29] */    
    } fcfmt_bit;
  };
  
  /**
    * @brief can fctyp register, offset:0x50 
    */
  union 
  {
    __IO uint32_t fctyp;
    struct
    {
      __IO uint32_t reserved1           : 24; /* [23:0] */
      __IO uint32_t handle              : 8; /* [31:24] */    
    } fctyp_bit;
  };

  /**
    * @brief can reserved register, offset:0x54
    */
  __IO uint32_t reserved5;
  
  /**
    * @brief can fmid register, offset:0x58 
    */
  __IO uint32_t fmid;
  
  /**
    * @brief can fmfmt register, offset:0x5C 
    */
  union 
  {
    __IO uint32_t fmfmt;
    struct
    {
      __IO uint32_t dlc                 : 4; /* [3:0] */
      __IO uint32_t reserved1           : 12; /* [15:4] */
      __IO uint32_t ide                 : 1; /* [16] */
      __IO uint32_t fdf                 : 1; /* [17] */  
      __IO uint32_t brs                 : 1; /* [18] */
      __IO uint32_t reserved2           : 1; /* [19] */
      __IO uint32_t rmf                 : 1; /* [20] */
      __IO uint32_t reserved3           : 3; /* [23:21] */
      __IO uint32_t koer                : 3; /* [26:24] */
      __IO uint32_t esi                 : 1; /* [27] */
      __IO uint32_t lbf                 : 1; /* [28] */
      __IO uint32_t reserved4           : 3; /* [31:29] */    
    } fmfmt_bit;
  };
  
  /**
    * @brief can fmtyp register, offset:0x60 
    */
  union 
  {
    __IO uint32_t fmtyp;
    struct
    {
      __IO uint32_t reserved1           : 24; /* [23:0] */
      __IO uint32_t handle              : 8; /* [31:24] */    
    } fmtyp_bit;
  };
  
  /**
    * @brief can reserved register, offset:0x64-0x6C
    */
  __IO uint32_t reserved6[3];
  
  /**
    * @brief can rbid register, offset:0x70
    */
  __IO uint32_t rbid;
  
  /**
    * @brief can rbfmt register, offset:0x74
    */
  union 
  {
    __IO uint32_t rbfmt;
    struct
    {
      __IO uint32_t dlc                 : 4; /* [3:0] */
      __IO uint32_t reserved1           : 12; /* [15:4] */
      __IO uint32_t ide                 : 1; /* [16] */
      __IO uint32_t fdf                 : 1; /* [17] */  
      __IO uint32_t brs                 : 1; /* [18] */
      __IO uint32_t reserved2           : 1; /* [19] */
      __IO uint32_t rmf                 : 1; /* [20] */
      __IO uint32_t reserved3           : 3; /* [23:21] */
      __IO uint32_t koer                : 3; /* [26:24] */
      __IO uint32_t esi                 : 1; /* [27] */
      __IO uint32_t lbf                 : 1; /* [28] */
      __IO uint32_t reserved4           : 3; /* [31:29] */    
    } rbfmt_bit;
  };
  
  /**
    * @brief can rbtyp register, offset:0x78
    */
  union 
  {
    __IO uint32_t rbtyp;
    struct
    {
      __IO uint32_t reserved1           : 24; /* [23:0] */
      __IO uint32_t handle              : 8; /* [31:24] */    
    } rbtyp_bit;
  };

  /**
    * @brief can reserved register, offset:0x7C
    */
  __IO uint32_t reserved7;
  
  /**
    * @brief can rbdat register, offset:0x80-0xC8
    */
  __IO uint32_t rbdat[19];
  
  /**
    * @brief can tbid register, offset:0xCC
    */
  __IO uint32_t tbid;
  
  /**
    * @brief can tbfmt register, offset:0xD0
    */
  union 
  {
    __IO uint32_t tbfmt;
    struct
    {
      __IO uint32_t dlc                 : 4; /* [3:0] */
      __IO uint32_t reserved1           : 12; /* [15:4] */
      __IO uint32_t ide                 : 1; /* [16] */
      __IO uint32_t fdf                 : 1; /* [17] */  
      __IO uint32_t brs                 : 1; /* [18] */
      __IO uint32_t reserved2           : 1; /* [19] */
      __IO uint32_t rmf                 : 1; /* [20] */
      __IO uint32_t reserved3           : 3; /* [23:21] */
      __IO uint32_t koer                : 3; /* [26:24] */
      __IO uint32_t esi                 : 1; /* [27] */
      __IO uint32_t lbf                 : 1; /* [28] */
      __IO uint32_t reserved4           : 3; /* [31:29] */    
    } tbfmt_bit;
  };
  
  /**
    * @brief can tbtyp register, offset:0xD4
    */
  union 
  {
    __IO uint32_t tbtyp;
    struct
    {
      __IO uint32_t reserved1           : 24; /* [23:0] */
      __IO uint32_t handle              : 8; /* [31:24] */    
    } tbtyp_bit;
  };
  
  /**
    * @brief can reserved register, offset:0xD8
    */
  __IO uint32_t reserved8;
  
  /**
    * @brief can tbdat register, offset:0xDC-0x118
    */
  __IO uint32_t tbdat[16];
  
  /**
    * @brief can reserved register, offset:0x11C-0x120
    */
  __IO uint32_t reserved9[2];
  
  /**
    * @brief can llcformat register, offset:0x124
    */
  __IO uint32_t llcformat;
  
  /**
    * @brief can llcsize register, offset:0x128
    */
  union
  {
    __IO uint32_t llcsize;
    struct
    {
      __IO uint32_t llcpbytes           : 16; /* [15:0] */
      __IO uint32_t llcaot              : 16; /* [31:16] */
    } llcsize_bit;
  };
  
  /**
    * @brief can reserved register, offset:0x12C-0x13C
    */
  __IO uint32_t reserved10[5];
  
  /**
    * @brief can inten register, offset:0x140
    */
  union
  {
    __IO uint32_t inten;
    struct
    {
      __IO uint32_t aien                : 1; /* [0] */
      __IO uint32_t eien                : 1; /* [1] */
      __IO uint32_t tsien               : 1; /* [2] */
      __IO uint32_t tpien               : 1; /* [3] */
      __IO uint32_t rafien              : 1; /* [4] */ 
      __IO uint32_t rfien               : 1; /* [5] */      
      __IO uint32_t roien               : 1; /* [6] */
      __IO uint32_t rien                : 1; /* [7] */
      __IO uint32_t beien               : 1; /* [8] */
      __IO uint32_t alien               : 1; /* [9] */
      __IO uint32_t epien               : 1; /* [10] */
      __IO uint32_t ttien               : 1; /* [11] */
      __IO uint32_t teien               : 1; /* [12] */
      __IO uint32_t wtien               : 1; /* [13] */
      __IO uint32_t reserved1           : 18; /* [31:14] */
    } inten_bit;
  }; 
} can_type;  

