young-nights/OTA-Upgrade-of-QI-Charger-Based-on-CAN/qi_wireless_code_slotB/libraries/drivers/inc/at32f422_426_can.h
#define CAN1                            ((can_type *) CAN1_BASE)

/** @defgroup CAN_exported_functions
  * @{
  */

void can_reset(can_type* can_x);
void can_software_reset(can_type* can_x, confirm_state new_state);
#ifdef SUPPORT_CAN_FD
void can_fd_iso_mode_enable(can_type* can_x, confirm_state new_state);
#endif
void can_mode_set(can_type* can_x, can_mode_type mode_selection);
error_status can_standby_mode_enable(can_type* can_x, confirm_state new_state);
void can_restricted_operation_enable(can_type* can_x, confirm_state new_state);
void can_bittime_default_para_init(can_bittime_type* can_bittime_struct);
void can_bittime_set(can_type* can_x, can_bittime_type* can_bittime_struct);
void can_retransmission_limit_set(can_type* can_x, can_retransmission_times_type re_trans_times);
void can_rearbitration_limit_set(can_type* can_x, can_rearbitration_times_type re_arbi_times);
void can_timestamp_enable(can_type* can_x, confirm_state new_state);
void can_timestamp_position_set(can_type* can_x, can_timestamp_position_type timestamp_position);

uint32_t can_transmit_timestamp_get(can_type* can_x);
error_status can_txbuf_write(can_type* can_x, can_txbuf_select_type txbuf_type, can_txbuf_type* can_txbuf_struct);
error_status can_txbuf_transmit(can_type* can_x, can_txbuf_transmit_type transmit_type);
void can_transmit_abort(can_type* can_x, can_abort_transmit_type abort_type);
void can_stb_transmit_mode_set(can_type* can_x, can_stb_transmit_mode_type stb_transmit_mode);
can_stb_status_type can_stb_status_get(can_type* can_x);
void can_transmit_status_get(can_type* can_x, can_transmit_status_type* transmit_status_struct);
error_status can_stb_clear(can_type* can_x, can_clear_stb_type clear_type);

void can_rxbuf_overflow_mode_set(can_type* can_x, can_rxbuf_overflow_mode_type rxbuf_overflow_mode);
void can_receive_all_enable(can_type* can_x, confirm_state new_state);
error_status can_rxbuf_read(can_type* can_x, can_rxbuf_type* can_rxbuf_struct);
error_status can_rxbuf_release(can_type* can_x);
can_rxbuf_status_type can_rxbuf_status_get(can_type* can_x);

void can_filter_enable(can_type* can_x, can_filter_type filter_number, confirm_state new_state);
void can_filter_default_para_init(can_filter_config_type* filter_config_struct);
void can_filter_set(can_type* can_x, can_filter_type filter_number, can_filter_config_type* filter_config_struct);

uint8_t can_arbitration_lost_position_get(can_type* can_x);
void can_rxbuf_warning_set(can_type* can_x, uint8_t warning_value);
void can_error_warning_set(can_type* can_x, uint8_t warning_value);
can_error_type can_kind_error_get(can_type* can_x);
uint8_t can_receive_error_counter_get(can_type* can_x);
uint8_t can_transmit_error_counter_get(can_type* can_x);
flag_status can_busoff_get(can_type* can_x);
void can_busoff_reset(can_type* can_x);

void can_ttcan_ref_message_set(can_type* can_x, can_identifier_type id_type, uint32_t id);
void can_ttcan_timer_div_set(can_type* can_x, can_ttcan_timer_div_type div_value); 
void can_ttcan_enable(can_type* can_x, confirm_state new_state); 
void can_ttcan_trigger_type_set(can_type* can_x, can_ttcan_trigger_type trigger_type);
void can_ttcan_trigger_set(can_type* can_x, uint16_t trigger_time);
void can_ttcan_watch_trigger_set(can_type* can_x, uint16_t watch_trigger_time);
void can_ttcan_transmit_window_set(can_type* can_x, uint8_t window_ticks);
void can_ttcan_txbuf_enable(can_type* can_x, confirm_state new_state);
void can_ttcan_txbuf_status_set(can_type* can_x, can_ttcan_txbuf_type txbuf_number, can_ttcan_txbuf_status_type status_type);
can_ttcan_txbuf_status_type can_ttcan_txbuf_status_get(can_type* can_x, can_ttcan_txbuf_type txbuf_number);
void can_ttcan_txbuf_transmit_set(can_type* can_x, can_ttcan_txbuf_type txbuf_number);
error_status can_ttcan_txbuf_write(can_type* can_x, can_ttcan_txbuf_type txbuf_number, can_txbuf_type* can_txbuf_struct);

void can_interrupt_enable(can_type* can_x, uint32_t can_int, confirm_state new_state);
flag_status can_flag_get(can_type* can_x, uint32_t can_flag);
flag_status can_interrupt_flag_get(can_type* can_x, uint32_t can_flag);
void can_flag_clear(can_type* can_x, uint32_t can_flag);

/*
note: 
the following functions is only support can-fd.
 - can_fd_iso_mode_enable
the following functions is support classic-can and can-fd.
 - can_bittime_default_para_init
 - can_bittime_set
 - can_txbuf_write
 - can_rxbuf_read
 - can_filter_default_para_init
 - can_filter_set 
 - can_ttcan_txbuf_write
*/

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
